Tekla Open API Reference for Tekla Structures 2025
InvalidRadiusException Fields
The InvalidRadiusException type exposes the following members.
Fields
Name | Description
OperationStatus
 Possible error statuses for geometry creation/modification commands.
 (Inherited from ConnectiveGeometryException.)
Top
See Also
Reference
InvalidRadiusException Class
Tekla.Structures.Model Namespace